#language: ru

Функционал: Яндекс-Маркет

  Сценарий: Наушники Beats

    Когда выбран пункт меню - "Маркет"
    Тогда закртытие вкладки Яндекс и переход во вкладку Маркет

    Когда выбор пункта меню  - "Электроника"
    Тогда переход в раздел - "Наушники и Bluetooth-гарнитуры"
    И нажимаем на кнопку Все фильтры

    Тогда поле "Цена" заполняется значением - "5000"
    И активация чекбокса -  "Beats"
    И нажатие на кнопку Показать

    Тогда вывдено результатов поисковой выдачи на странице:  "17"
    И запоминаем первое значение списка в первой поисковой выдаче

    Тогда в поле поиска вводим запомненное значение
    И нажимаем кнопку Найти

    Тогда запоминаем первое значение списка во второй поисковой выдаче
    Тогда наименование товара соответствует запомненному значению

  Сценарий: Телевизоры LG, Samsing

    Когда выбран пункт меню - "Маркет"
    Тогда закртытие вкладки Яндекс и переход во вкладку Маркет

    Когда выбор пункта меню  - "Электроника"
    Тогда переход в раздел - "Телевизоры"
    И нажимаем на кнопку Все фильтры

    Тогда поле "Цена" заполняется значением - "20000"
    И активация чекбокса -  "LG"
    И активация чекбокса -  "Samsung"
    И нажатие на кнопку Показать

    Тогда вывдено результатов поисковой выдачи на странице:  "48"
    И запоминаем первое значение списка в первой поисковой выдаче

    Тогда в поле поиска вводим запомненное значение
    И нажимаем кнопку Найти

    Тогда запоминаем первое значение списка во второй поисковой выдаче
    Тогда наименование товара соответствует запомненному значению




